In [212]:
import numpy as np 
import pandas as pd 
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_samples,silhouette_score
import matplotlib.pyplot as plt 
%matplotlib inline

In [213]:
dropout = pd.read_excel(r"C:/Users/ADMIN/Documents/Codebase/Data-science-projects/Education/dropout.xls")
dropout

,STATE_UT,YEAR,PRIMARY_BOYS,PRIMARY_GIRLS,PRIMARY_TOTAL,UPPER_PRIMARY_BOYS,UPPER_PRIMARY_GIRLS,UPPER_PRIMARY_TOTAL,SECONDARY_BOYS,SECONDARY_GIRLS,SECONDARY_TOTAL,HRSECONDARY_BOYS,HRSECONDARY_GIRLS,HRSECONDARY_TOTAL
0,A & N Islands,2012-13,0.83,0.51,0.68,1.44,1.09,1.23,5.57,5.55,5.56,17.66,10.15,14.14
1,A & N Islands,2013-14,1.35,1.06,1.21,1.44,1.54,0.51,8.36,5.98,7.20,18.94,12.20,15.87
2,A & N Islands,2014-15,0.47,0.55,0.51,1.44,1.95,1.69,11.47,8.16,9.87,21.05,12.21,16.93
3,Andhra Pradesh,2012-13,3.30,3.05,3.18,3.21,3.51,3.36,12.21,13.25,12.72,2.66,0.00,0.35
4,Andhra Pradesh,2013-14,4.31,4.39,4.35,3.46,4.12,3.78,11.95,13.37,12.65,12.65,10.85,11.79
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
105,West Bengal,2013-14,3.44,2.37,2.91,5.63,3.10,4.31,16.73,19.77,18.34,8.03,7.76,7.90
106,West Bengal,2014-15,2.13,0.79,1.47,5.84,2.88,4.30,16.33,19.06,17.80,8.18,8.04,8.11
107,All India,2012-13,4.68,4.66,4.67,2.30,4.01,3.13,14.54,14.54,14.54,0.00,0.00,0.00
108,All India,2013-14,4.53,4.14,4.34,3.09,4.49,3.77,17.93,17.79,17.86,1.48,1.61,1.54
109,All India,2014-15,4.36,3.88,4.13,3.49,4.60,4.03,17.21,16.88,17.06,0.25,0.00,0.00

In [214]:
states=[]
for i in range(36):
    states.append(dropout.STATE_UT.iloc[3*i])
states=pd.DataFrame(states, columns=['State'])

In [215]:
dropout.drop(['STATE_UT','YEAR'],axis=1,inplace=True)

In [216]:
dropout.describe()

,PRIMARY_BOYS,PRIMARY_GIRLS,PRIMARY_TOTAL,UPPER_PRIMARY_BOYS,UPPER_PRIMARY_GIRLS,UPPER_PRIMARY_TOTAL,SECONDARY_BOYS,SECONDARY_GIRLS,SECONDARY_TOTAL,HRSECONDARY_BOYS,HRSECONDARY_GIRLS,HRSECONDARY_TOTAL
count,110.000000,110.000000,110.000000,110.000000,110.000000,110.000000,110.000000,110.000000,110.000000,110.00000,110.000000,110.000000
mean,4.293455,4.010818,4.150000,3.784091,4.169455,3.839000,17.162273,16.311455,16.761364,6.96800,4.979364,5.958273
std,4.674719,4.553512,4.601164,3.243136,3.444964,3.351027,8.931009,9.403942,9.060955,7.40457,5.468031,6.403142
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
25%,0.540000,0.590000,0.665000,1.440000,1.580000,1.200000,11.312500,9.385000,9.952500,0.05750,0.000000,0.000000
50%,2.900000,2.440000,2.885000,3.175000,3.535000,3.370000,16.105000,14.985000,15.035000,5.68000,3.880000,4.595000
75%,6.742500,5.870000,6.300000,5.422500,5.835000,5.462500,23.012500,21.682500,22.832500,11.76500,8.470000,9.380000
max,24.270000,23.930000,24.110000,19.350000,19.210000,19.280000,50.090000,49.620000,49.860000,44.38000,36.050000,40.480000

In [217]:
x=pd.DataFrame()
for i in range(36):
    x[i]=dropout.iloc[3*i+0:i*3+3,:].mean()
x=x.transpose()    
x.head(5)

,PRIMARY_BOYS,PRIMARY_GIRLS,PRIMARY_TOTAL,UPPER_PRIMARY_BOYS,UPPER_PRIMARY_GIRLS,UPPER_PRIMARY_TOTAL,SECONDARY_BOYS,SECONDARY_GIRLS,SECONDARY_TOTAL,HRSECONDARY_BOYS,HRSECONDARY_GIRLS,HRSECONDARY_TOTAL
0,0.883333,0.706667,0.800000,1.440000,1.526667,1.143333,8.466667,6.563333,7.543333,19.216667,11.520000,15.646667
1,4.726667,4.776667,4.750000,3.920000,4.316667,4.113333,13.323333,14.073333,13.693333,5.103333,3.616667,4.046667
2,12.963333,11.583333,12.290000,5.203333,7.960000,6.590000,16.133333,13.443333,14.843333,15.263333,11.690000,13.533333
3,10.426667,8.930000,9.680000,8.646667,7.883333,8.253333,26.293333,29.723333,28.086667,4.163333,3.776667,3.976667
4,0.910000,0.596667,0.696667,3.226667,2.400000,2.353333,26.330000,27.983333,27.123333,0.000000,0.000000,0.000000

In [224]:
scores=[]
for i in range(2,36):
    k=KMeans(n_clusters=i,n_init=50)
    k.fit(x)
    label=KMeans.predict(k,x)
    scores.append(silhouette_score(x, label))
pd.DataFrame(scores).plot()
plt.axvline(3)
plt.text(3,0.34,s="Max silhoutte score at n=3")

In [239]:
best_cluster_no=np.argmax(scores[2:36])+2
k=KMeans(n_clusters=best_cluster_no)
k.fit(x)
lab = pd.DataFrame(k.labels_,columns=['Labels'])

In [247]:
result=pd.concat([states['State'],x,lab['Labels']],axis=1)
result.groupby('Labels')['PRIMARY_BOYS', 'PRIMARY_GIRLS', 'PRIMARY_TOTAL',
       'UPPER_PRIMARY_BOYS', 'UPPER_PRIMARY_GIRLS', 'UPPER_PRIMARY_TOTAL',
       'SECONDARY_BOYS', 'SECONDARY_GIRLS', 'SECONDARY_TOTAL',
       'HRSECONDARY_BOYS', 'HRSECONDARY_GIRLS', 'HRSECONDARY_TOTAL'].agg('mean')

<ipython-input-247-2d413833ed51>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result.groupby('Labels')['PRIMARY_BOYS', 'PRIMARY_GIRLS', 'PRIMARY_TOTAL',

,PRIMARY_BOYS,PRIMARY_GIRLS,PRIMARY_TOTAL,UPPER_PRIMARY_BOYS,UPPER_PRIMARY_GIRLS,UPPER_PRIMARY_TOTAL,SECONDARY_BOYS,SECONDARY_GIRLS,SECONDARY_TOTAL,HRSECONDARY_BOYS,HRSECONDARY_GIRLS,HRSECONDARY_TOTAL
Labels,,,,,,,,,,,,
0,6.951333,6.541667,6.732667,6.732333,6.935333,6.779667,26.685333,26.733667,26.721333,4.377667,2.803667,3.530000
1,4.087895,3.938772,4.013509,3.006842,3.716667,3.223684,14.576140,13.607018,14.116667,5.100175,4.473509,4.756316
2,1.040000,0.590952,0.822857,1.729048,1.411429,1.302381,10.538571,8.665714,9.644762,16.319524,9.858095,13.183810

In [326]:
grouping=result[['State','Labels']]
zer=pd.Series(np.array(grouping.State[grouping.Labels==0]), name="Cluster 0").to_frame()
one=pd.Series(np.array(grouping.State[grouping.Labels==1]), name="Cluster 1").to_frame()
two=pd.Series(np.array(grouping.State[grouping.Labels==2]), name="Cluster 2").to_frame()
pd.concat([zer,one,two],axis=1)

               Cluster 0           Cluster 1         Cluster 2
0                  Assam      Andhra Pradesh     A & N Islands
1                  Bihar  Arunachal  Pradesh        Chandigarh
2   Dadra & Nagar Haveli        Chhattisgarh       Daman & Diu
3              Jharkhand             Gujarat             Delhi
4              Karnataka             Haryana               Goa
5        Madhya  Pradesh     Jammu & Kashmir  Himachal Pradesh
6              Meghalaya              Kerala            Sikkim
7                Mizoram         Lakshadweep               NaN
8               Nagaland         Maharashtra               NaN
9                 Odisha             Manipur               NaN
10                   NaN          Puducherry               NaN
11                   NaN              Punjab               NaN
12                   NaN           Rajasthan               NaN
13                   NaN         Tamil  Nadu               NaN
14                   NaN           Telangana               NaN
15                   NaN             Tripura               NaN
16                   NaN       Uttar Pradesh               NaN
17                   NaN         Uttarakhand               NaN
18                   NaN         West Bengal               NaN

In [292]:
result[['PRIMARY_TOTAL', 'UPPER_PRIMARY_TOTAL', 'SECONDARY_TOTAL','HRSECONDARY_TOTAL']].corr().style.background_gradient(cmap='RdBu')